{
  "heading": "Loopring - Across the stack",
  "starter": "Loopring project began in June 2017, and has evolved into a multifaceted Ethereum effort, operating across the stack, from protocol to product.",

  "version10": {
    "title": "Loopring Protocol",
    "content": [
      "Loopring protocol is an open source zkRollup protocol. It is a collection of Ethereum smart contracts and ZK circuits which describe how to build highly-secure, highly-scalable orderbook-based DEXes, AMMs, and payment apps. It was the first rollup protocol deployed on Ethereum, and has led the ecosystem into the era of Layer 2 scaling (L2). The current protocol version, v3.8, is our fifth deployed version (the first three were non-zkRollup). It provides a solution for the most outstanding challenge of all decentralized protocols - performance, or more precisely, <b>much higher performance without a tradeoff in security.</b>",
      "<a className='underline ' href='/#/protocol'> Click here</a> to learn about the technical details of Loopring protocol 3.8."
    ]
  },
  "version15": {
    "title": "Loopring Relayer",
    "content": [
      "Loopring relayer (aka operator) is our implementation of the backend system that interacts with the protocol to make a zkRollup run. It hosts and updates the off-chain Merkle tree, creates rollup blocks, generates zkSNARK proofs of their validity, publishes data + proofs to Ethereum, and more. Our relayer has been highly optimized for its use case: from orderbook matching to proof generation. Note: in doing all of this, it can never, ever, access or freeze user funds - the protocol simply does not allow it.",
      "While Loopring protocol is agnostic to relayer (anyone can build & use their own relayer(s) to run their zkRollup/products), what is known as the canonical 'Loopring L2' (and the products atop) is serviced by the Loopring relayer. Loopring relayer API can be used by builders, users, and other applications that want to perform gas-free, high-speed trading and transfers on Ethereum, or otherwise read or write to our L2."
    ]
  },
  "version20": {
    "title": "Loopring Exchange",
    "content": [
      "Loopring Exchange (app.loopring.io) is a high-performance, non-custodial exchange (AMM and orderbook) and payment platform that the Loopring team operates. It is built on the Loopring protocol, run by the Loopring relayer, and provides the most advanced and enjoyable trading experience on Ethereum. Gas-free, blazing fast, completely secure. Whether you are doing a single swap, 30 trades per minute, providing liquidity in the AMM pool or orderbook, or transferring tokens to 1 friend or 100 friends, Loopring Exchange is the L2 standard.",
      "<a className='underline ' href='https://app.loopring.io'> Click here</a> to get on the Loopring Exchange. It requires only an Ethereum wallet."
    ]
  },
  "version30": {
    "title": "Loopring Wallet",
    "content": [
      "Loopring Wallet is an Ethereum mobile smart contract wallet, with Loopring zkRollup baked in. It is the first smart wallet app with L2 scaling, and provides a secure, intuitive, powerful Ethereum experience in your pocket. Swap on the AMM, become an LP, trade on the books, invest & earn in DeFi, send payments to anyone, anywhere - all gas-free, and at the tap of a finger.",
      "Completely self-custodial, only smarter. You can say goodbye to seed phrases and paper backups, and say hello to social recovery. This means choosing people, institutions, and hardware that you trust as the guardians of your wallet. If ever you lose access to your mobile, they help you recover your assets. As long as more than half of your guardians are trustworthy, your assets are secure. You can also set limits on daily transfers, and whitelist trusted addresses.",
      "<a className='underline ' href='https://app.loopring.io'> Click here</a> to visit the Loopring Smart Wallet page, where you can download the app."
    ]
  }
}
