{
  "heading": "Crypto Hacks",
  "total": "More than $2.1 billion of cryptoassets have been hacked from centralized exchanges - and counting. Due to the bearer instrument nature of cryptoassets - whoever holds the private key, \"owns\" it - CEXes remain the largest and most attractive honeypots for thieves and other bad actors. The following stories have been reported by third-party media.",
  "learn": "Learn how Loopring 3.0 is designed to be secure",
  "stories": [
    {
      "title": "$34,300,000 / Remixpoint",
      "date": "07-2019",
      "source": "https://www.pymnts.com/cryptocurrency/2019/major-crypto-hacks/",
      "detail": "Days after admitting to a hack that caused the loss of $32 million in cryptocurrency, Bitpoint Japan, a cryptocurrency exchange operator run by Remixpoint, said on Sunday (July 14) it has discovered an additional $2.3 million was stolen."
    },

    {
      "title": "$6,000,000 / BitMarket",
      "date": "07-2019",
      "source": "https://www.financemagnates.com/cryptocurrency/exchange/hackers-behind-bitmarket-shutdown/",
      "detail": "In a statement, one of BitMarket's directors said that the exchange was hacked in 2017 as a result of which \"several users and technical accounts of the stock exchange lost more than 600 BTC.\""
    },
    {
      "title": "$8,000,000 / Binance",
      "date": "07-2019",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/#fn1",
      "detail": "Binance experienced a major breach on May 7 and the hackers were able to withdraw 7,000 bitcoins (currently over USD $40 million). Essentially the hackers were able to steal funds from Binance's hot wallet and seemingly was done in a way to bypass all of Binance's security checks."
    },
    {
      "title": "$5,000,000 / Bitrue",
      "date": "06-2019",
      "source": "https://cointelegraph.com/news/round-up-of-crypto-exchanges-hack-so-far-in-2019-how-can-it-be-stopped",
      "detail": "Singapore-based cryptocurrency exchange Bitrue has acknowledged the fact that it suffered a major attack in which 9.3 million XRP and 2.5 million ADA worth around $5 million at the time were stolen from the exchange’s hot wallets."
    },
    {
      "title": "$10,000,000 / GateHub",
      "date": "06-2019",
      "source": "https://cointelegraph.com/news/round-up-of-crypto-exchanges-hack-so-far-in-2019-how-can-it-be-stopped",
      "detail": "The United Kingdom and Slovenia-based crypto exchange GateHub reported the loss of nearly $10 million worth of XRP. 18,473 accounts affected."
    },
    {
      "title": "$7,000,000 / DragonEX",
      "date": "03-2019",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/#fn1",
      "detail": "The Singapore-based exchange DragonEX was hacked in March 2019, and lost an estimated USD 7 Million to the attacker. The company behind the exchange has not really released any details regarding the security breach, only that they will not be going bankrupt. The exchange promised to figure out a compensation plan for their users by providing USDT credit or Dragon Token (DT)."
    },

    {
      "title": "$13,000,000 / Bithumb",
      "date": "03-2019",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/#fn1",
      "detail": "Bithumb really appears to be quite relaxed on security! This is the third time they have been hacked, though this time they have claimed it was an inside job. The exchange was hacked for 3.07 million EOS and 20.2 million XRP, and the attacker was able to liquidate most of it."
    },
    {
      "title": "$4,000,000 / Cryptopia",
      "date": "01-2019",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/#fn1",
      "detail": "The full amount of lost funds is unknown, however, 19,390 ETH has been seen transferred to an unknown wallet. "
    },
    {
      "title": "$30,000,000 / Pure Bit",
      "date": "11-2018",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/#fn1",
      "detail": "After raising over $30,000,000 in an ICO selling their tokens to create a cryptocurrency exchange in South Korea, Pure Bit defrauded their initial investors and customers by executing an exit scam which started on November 9th. Over 13,000 ETH has been moved from Pure Bit's address, and they even went so far as trying to sell a portion of it on UpBit (a large local exchange in South Korea). "
    },

    {
      "title": "$6,000,000 / MapleChange",
      "date": "10-2018",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/#fn1",
      "detail": "The small Canadian based exchange called MapleChange which was seeing a modest volume of around $67,000 USD per day since its launch in May 2018 claimed they were hacked or suffered a bug which resulted in all customer's deposited funds being withdrawn. "
    },

    {
      "title": "$60,000,000 / Zaif",
      "date": "09-2018",
      "source": "https://www.zdnet.com/article/zaif-cryptocurrency-exchange-loses-60-million-in-july-hack/",
      "detail": "Japanese cryptocurrency exchange Zaif announced that it lost $60 million worth of company and user funds during a security incident that took place last week."
    },
    {
      "title": "$31,500,000 / Bithumb",
      "date": "06-2018",
      "source": "https://www.fliptopay.com/blogs/blog-1/bithumb-hacked-with-30-million-stolen-uk-exchange-launching-litecoin-futures-and-japan-to-vote-on-banning-insider-trading-and-privacy-coins",
      "detail": "Bithumb, the world's sixth-largest crypto exchange by trading volume, was hacked. According to a company announcement, the South Korean exchange had 35,000,000,000 KRW, or $31,500,000 USD worth of cryptocurrency stolen in the hack. "
    },
    {
      "title": "$40,000,000 / Coinrail",
      "date": "06-2018",
      "source": "https://www.coindesk.com/coinrail-exchange-hacked-loses-possibly-40-million-in-cryptos",
      "detail": "Coinrail, a cryptocurrency exchange based in South Korea, said its platform has been hacked, with other sources suggesting it lost cryptocurrencies totaling as much as $40 million in the attack."
    },
    {
      "title": "$3,300,000 / CoinSecure",
      "date": "04-2018",
      "source": "https://www.zdnet.com/article/coinsecure-not-so-secure-millions-in-cryptocurrency-stolen-cso-branded-as-thief/",
      "detail": "The Indian cryptocurrency exchange has accused Dr. Amitabh Saxena, the firm's Chief Strategy Officer (CSO), of being involved in the loss of 438 Bitcoins (BTC), worth roughly $3.3 million at the time of writing."
    },
    {
      "title": "$195,000,000 / BitGrail",
      "date": "02-2018",
      "source": "https://fortune.com/2018/02/11/bitgrail-cryptocurrency-claims-hack/",
      "detail": "An obscure Italian cryptocurrency exchange called BitGrail claims that it was hacked late last week and lost roughly $195 million worth of customers’ cryptocurrency. But others - including the developers who created the stolen cryptocurrency - have suggested not all may be as it appears."
    },
    {
      "title": "$534,800,000 / Coincheck",
      "date": "01-2018",
      "source": "https://www.btcnn.com/the-best-bitcoin-hacks/",
      "detail": "Coincheck, an exchange service, adopted cold wallets for their Bitcoin transactions but forgot to give adequate attention to security for NEM, a promising Asian cryptocurrency. They kept all deposits associated with NEM in a single wallet, and that was a costly error. No one can categorically explain how the loss occurred, but the aftermath was a devastating experience for their customers."
    },

    {
      "title": "$5,000,000 / Bitstamp",
      "date": "01-2018",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/",
      "detail": "Bitstamp was the first major crypto exchange to be hacked in 2018, which resulted in a loss of roughly $5m in bitcoin. This hack showed that cryptocurrency exchanges were now on the radar for all types of security breaches, this attacker took a social engineering approach and had been targetting six Bitstamp employees for weeks. The attacker sent messages to the employees on Skype and email, trying to appeal to their personal interests in hopes that they would open the malware."
    },
    {
      "title": "$60,000,000 / NiceHash ",
      "date": "12-2017",
      "source": "https://www.coindesk.com/62-million-gone-cryptocurrency-mining-market-nicehash-hacked",
      "detail": "A wallet address circulated by NiceHash users suggest that as many as 4,736.42 BTC – an amount worth more than $62 million at current prices – has been stolen."
    },
    {
      "title": "$1,800,000 / Coinis",
      "date": "12-2017",
      "source": "BBB",
      "detail": "A much smaller South Korean exchange that was hacked in September 2017, many believe that it was targeted by the criminal hacking group Lazarus. No details were released on the security breach, or if the hack was reported to the police. Coinis simply advised they would provide compensation for customers that were left out of pocket by the hack."
    },
    {
      "title": "$3,000,000 / OKEx",
      "date": "08-2017",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/",
      "detail": "Not much is known about the Chinese exchange OKEx being hacked in August 2017, notably, because instead of owning up to it they blamed the users. OKEx is the leading Bitcoin trading platform in China, and has always denied that it was hacked. "
    },
    {
      "title": "$7,000,000 / Bithumb",
      "date": "07-2017",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/",
      "detail": "Bithumb was the fourth largest cryptocurrency exchange at the time by volume was hacked for the first time in July 2017. This was the start of many security incidents with for bithumb, all stemming from an attacker getting control of an employee's PC and being able to steal about 3% of the platform's user credentials. Bithumb has always claimed to not know the exact amount the attacker took, and though local South Korean media claims it was in the billions, estimations today put it around $7 million in Bitcoin and Ethereum."
    },
    {
      "title": "$5,300,000 / Yapizon (Youbit)",
      "date": "05-2017",
      "source": "https://www.wsj.com/articles/cryptocurrency-exchange-collapses-files-for-bankruptcy-after-second-hack-1513683519",
      "detail": "A cryptocurrency exchange in South Korea collapsed on Tuesday after it suffered a second cyberattack in eight months and lost a large amount of its digital-currency reserves.Yapian, the company that operates a Seoul-based exchange called Youbit, suspended digital-currency trading and filed for bankruptcy after its systems were hacked in the predawn hours of Tuesday. The exchange trades 10 virtual currencies including bitcoin and ethereum."
    },
    {
      "title": "$72,000,000 / Bitfinex",
      "date": "08-2016",
      "source": "https://www.btcnn.com/the-best-bitcoin-hacks/",
      "detail": "Bitfinex promoted its service as possessing multi-signature wallets for every of their client, but unfortunately, their advertised multi-signature technology was of no use against hackers which led to the loss of 120,000 bitcoins belonging to their customers. "
    },
    {
      "title": "$1,750,000 / BTER.com",
      "date": "02-2015",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/",
      "detail": "Bter has been hacked before for a smaller amount of money in NXT equivalent. They haven't learned their lesson (as a number of other hacked exchanges don't) and got hacked again in 2015. The real question is, why do they still have customers after being repeatedly hacked again and again?"
    },
    {
      "title": "$5,100,000 / Bitstamp",
      "date": "01-2015",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/",
      "detail": "Hackers sent a malicious file to exchange employees. One of the system administrators has neglected security rule #1: \"Don't open files from strangers\" and opened the file on the machine that had access to the exchange's BTC wallet. 19,000 BTC were stolen."
    },
    {
      "title": "$1,800,000 / bitpay",
      "date": "12-2014",
      "source": "https://www.ccn.com/bitpay-hacked-5-000-bitcoins-stolen/",
      "detail": "The Atlanta-based Bitpay was hacked on three separate occasions in December of 2014. More than 5 000 bitcoins were stolen."
    },
    {
      "title": "$3,200,000 / Mintpal",
      "date": "12-2014",
      "source": "BBB",
      "detail": "At one time the cryptocurrency exchange Mintpal was one of the top trading platforms. In the fall of 2014 customers were told Mintpal was going to have new ownership. The exchange was sold to a Moopay executive “Alex Green” who many believe was a shady scammer. Most likely the vulnerability already existed at the time of sale and the new owner just failed to detect and patch it. However, many suggest that it was simply an inside job and Alex Green \"hacked\" himself."
    },
    {
      "title": "$9,500,000 / Cryptsy",
      "date": "07-2014",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/",
      "detail": "The attacker – famous for developing Lucky7Coin – inserted a Trojan malware into Cryptsy’s code so that he could access precious information and transfer cyber currencies – mainly bitcoin and litecoin – out of the exchange’s wallet."
    },
    {
      "title": "$700,000,000 / MT.GOX",
      "date": "03-2014",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/",
      "detail": "It is no surprise that by far the biggest hack in the history of cryptocurrencies happened to Bitcoin in the days of its infancy. The world's most popular exchange, MtGox, finally admitted its insolvency due to ongoing hacks. MtGox employees failed to protect the private keys of its wallet where it stored all the customer's deposits, and hackers would routinely drain this wallet into their own pockets. Everybody who had money stored on the exchange lost it. This amount of Bitcoin is currently worth more than 6 billion USD."
    },

    {
      "title": "$50,000,000 / Vircurex",
      "source": "https://www.coindesk.com/exchange-vircurex-freezes-withdrawals-claims-lack-reserves",
      "date": "03-2014",
      "detail": "In a lawsuit filed in the U.S. District Court in Colorado, a former Vircurex customer accuses the exchange of breach of contract, conversion of funds, fraud and unjust enrichment. The suit explained how only a few of the account holders had received their funds after the exchange froze all withdrawals due to a claimed lack of reserves. At present, the frozen accounts contain a combined $50 million."
    },

    {
      "title": "$1,200,000 / Inputs.io",
      "date": "11-2013",
      "source": "https://www.coindesk.com/hackers-steal-bitcoins-inputs-io-wallet-service",
      "detail": "Two hacks totalling about 4100 BTC have left Inputs.io unable to pay all user balances. The attacker compromised the hosting account through compromising email accounts (some very old, and without phone numbers attached, so it was easy to reset). The attacker was able to bypass 2FA due to a flaw on the server host side."
    },
    {
      "title": "$1,000,000 / BIPS",
      "date": "11-2013",
      "source": "https://thehackernews.com/2013/11/danish-bitcoin-exchange-bips-hacked-and_25.html",
      "detail": "A bunch of cyber criminals just broke into BIPs -Bitcoin payment processor servers and wiped out around 1,295 Bitcoin from people’s wallets, currently worth $1 Million. More than 22,000 consumer wallets have been compromised and BIPS will be contacting the affected users."
    },
    {
      "title": "$3,000,000 / PicoStocks",
      "date": "11-2013",
      "source": "https://bitcointalk.org/index.php?topic=576337#post_toc_58",
      "detail": "PicoStocks, a stock exchange using a novel means of circumventing legal regulation, reported that someone that previously had access to PicoStocks keys used them to defund both hot and cold wallets. Creditors were reportedly unaffected as, despite the magnitude of the loss, PicoStocks covered it completely."
    },
    {
      "title": "$270,000,000 / Silk Road",
      "date": "10-2013",
      "source": "https://blog.saturn.network/list-of-documented-exchange-hacks/",
      "detail": "Although not a cryptocurrency exchange, but instead a marketplace that accepted cryptocurrency, Silk Road was nonetheless a place where people stored their money. When the FBI managed to track down the exchange's owner they have confiscated all of the BTC that was deposited on the website's account."
    },
    {
      "title": "$250,000 / Bitfloor",
      "date": "12-2012",
      "source": "https://bitcoinmagazine.com/articles/bitfloor-hacked-250000-missing-1346821046",
      "detail": "Bitfloor, the fourth largest exchange dealing in US dollars, has just announced that it has been hacked, and the service has taken a loss of 24,000 BTC, worth about $250,000 at the time of the theft. "
    }
  ]
}
