{
  "overview": "Overview",
  "section1": {
    "title": "Loopring's Vision and Objectives",
    "p1": "The blockchain technology empowers definite ownership — the ownership of digital assets, and soon the ownership of physical assets as well.It is believed to be the disruptor to the traditional notions of currency and will establish the very foundation of the next generation of finance.It is, however, ironic that most crypto - holders are still trading their assets on Centralized Exchanges, or CEXes, by giving up their ownership temporarily.Over the years, more than two billion US dollars crypto - assets that belong to the users got hacked on those platforms. ",
    "p2": "We believe that crypto-trading shall be and can be made risk - free on Decentralized Exchanges, or DEXes, that are powered by blockchain and Smart Contract technology.We also envision that trading crypto - assets on DEXes will be less expensive compared to CEXes, and the liquidity will be aggregated at a much larger scale, if not globally. ",
    "p3": "Loopring's objective is to design and engineer the best-in-class order - based DEX protocol and make it available for the whole industry to improve crypto - holders ' overall trading experience.We expect our effort will accelerate the adoption of the blockchain technology and crypto - currencies. "
  },
  "subtitle2": "LOOPRING PROTOCOL IS SECURE",
  "subtitle3": "THE REDEMPTION OF CENTRALIZED EXCHANGES",
  "section4": {
    "title": "LOOPRING IS REMARKABLELY PERFORMANT",
    "p1": "Most DEX protocols suffer terrible performance issues — the throughput is too low while the cost is too high. The performance issues prevent those protocol from being massively adopted as no professional market makers or traders will use these protocols as their primary methods of trading.",
    "p2": "We believe the way most other trading protocols use the underlying blockchain is fundamentally wrong. Loopring takes a different approach known as <a class='highlight underline has-trailing-arrow'href='https://ethresear.ch/t/on-chain-scaling-to-potentially-500-tx-sec-through-mass-tx-validation/3477'target='_blank'rel='noopener noreferrer'> zkRollup proposed by Vitalik Buterin </a> , and migrates most computations off the blockchain and only broadcast exchanges' new state roots and their corresponding proofs onto the blockchain. In other words, the Loopring protocol uses the underlying Ethereum blockchain mainly as a data layer and a Zero-Knowledge Proof verification thin-logic layer. As a result, Loopring's throughput is as high as 350 trades per second with on-chain data-availability is on, and 6,900 trades per second without. The post-Istanbul throughput will become 1,400 and 10,500 respectively. The cost per trade settlement is as small as one-third of a US cent, which can be further optimized with different approaches such as GPU-based proof generation and recursive SNARKs.",
    "p3": "We believe Loopring's performance is sufficient for professional traders and market makers to take advantage of bots for trading automation. Decentralized exchanges built on top of Loopring 3.0 will soon beat many centralized ones."
  }
}
