{
  "overview": "Overview",
  "section1": {
    "title": "Loopring's Vision and Objectives",
    "content": [
      "Blockchain technology empowers real ownership - ownership of digital assets, and soon, the ownership of legacy, or physical assets as well. This technology and the cryptoassets it supports have upended traditional notions of currency and will establish the foundation of the next generation of finance.",
      "Ironically, however, most cryptoasset holders still trade these assets on Centralized Exchanges, or CEXes, temporarily giving up their ownership (keys) to intermediaries, and eschewing a primary benefit & virtue of the asset itself. Over the years, people have lost more than two billion USD of cryptoassets on these platforms. Further, it is often difficult to distinguish if this was stolen by external hackers or an inside job by malicious owners.",
      "We believe that cryptoasset trading should be - and will be - risk-free and worry-free in terms of custody. Traders should have strong cryptographic guarantees that their assets cannot be wrongfully taken from the platforms where they trade - not by hackers, and not by exchange owners. The solution is to trade on Decentralized Exchanges, or DEXes - powered by the underlying blockchains & smart contracts where these assets live. We also envision that trading cryptoassets on DEXes will be less expensive compared to CEXes, because security is essentially outsourced to the blockchain and cryptographic processes, instead of large, expensive, fallible human teams. These cost savings can be passed on to users. Finally, liquidity will be able to be aggregated at a much larger scale, if not globally."
    ],
    "objective": "Loopring's objective is to design and engineer the best-in-class <b>orderbook-based DEX protocol</b> on Ethereum. We wish to make this infrastructure available for the whole industry, powering people to build highly scalable decentralized crypto-exchanges, and improving cryptoasset holders' overall trading experience and peace of mind. We expect that our effort will accelerate the adoption of blockchain technology and cryptocurrencies."
  },
  "section2": {
    "title": "LOOPRING PROTOCOL IS SECURE",
    "content": [
      "The security of user assets is and will always remain Loopring's top priority. The three previous versions of the Loopring protocol do not take any custody of user assets at all - traders are always in possession of their assets. The latest version, Loopring 3.0, relies on smart contracts to hold assets to be traded. We designed the protocol in such a way that users can always claim their assets in all circumstances, even when DEX operators are evil.",

      "Loopring 3.0 does not rely on challenging games or fraud proofs as found in Optimistic Rollup. Instead, the protocol enforces proactive and in-time Zero-Knowledge Proofs to attest DEX states to achieve the highest level of security.",

      "We claim that Loopring offers users the same level of security as the underlying Ethereum blockchain - if a feature called <b>On-Chain Data Availability (OCDA)</b> is turned on in v3. Trading on Loopring-based DEXes does not demand traders place any trust in the DEX owners or operators, nor the Loopring team. In terms of crypto-trading, we believe <b>being trustless will become the new standard of trustworthiness</b>."
    ]
  },
  "section3": {
    "title": "THE REDEMPTION OF CENTRALIZED EXCHANGES",
    "content": [
      "If you have ever run a centralized exchange business, you know the stress and fear of being hacked. Loopring ensures that even if all your servers were compromised, you will, at worst, only lose a couple of Ether that you use as transaction fees (gas). You can always recover from such incidences and resume your business. Using an open-sourced, audited, cryptographically sound protocol means less time & money spent on security, and more on growing your business."
    ]
  },
  "section4": {
    "title": "LOOPRING IS REMARKABLELY PERFORMANT",
    "content": [
      "Most DEX protocols suffer terrible performance issues - the throughput is too low while the cost is too high. The performance issues prevent those protocols from being massively adopted as no professional market makers or traders will use these protocols as their primary methods of trading. The performance vs. security tradeoff has indeed been a polarizing one.",

      "We believe the way many trading protocols use the underlying blockchain is fundamentally flawed. Loopring takes a different approach known as <b>zkRollup</b> proposed by <b>Vitalik Buterin</b>.  zkRollup migrates most computations off the blockchain and only broadcasts exchanges' new state roots and their corresponding proofs onto the blockchain. In other words, the Loopring protocol uses the underlying Ethereum blockchain mainly as a data layer and a Zero-Knowledge Proof verification thin-logic layer. As a result, Loopring's throughput is as high as <b>350</b> trades per second with OCDA, and <b>6,900</b> trades per second without. The post-Istanbul throughput will become <b>1,400</b> and <b>10,500</b>, respectively. The cost per trade settlement is as small as 0.21 US cent, which can be further optimized, such as using GPU-based proof generation and recursive SNARKs.",
      "We believe Loopring's performance is sufficient for professional traders and market makers to deploy algorithmic strategies and other automated trading bots. By building on top of Loopring 3.0, orderbook-based DEXes can be commercially viable for the first time. We expect such DEXes to begin outcompeting and displacing many centralized counterparts."
    ]
  }
}
