{
    "overview": "关于路印",
    "section1":
    {
        "title": "愿景与目标",
        "content": [
            "区块链技术赋予个体对加密资产无法篡改的所有权，并且很快会应用在其它类型数字资产和实物资产的所有权与使用权上。区块链和加密资产已经开始颠覆经济中的货币概念，并将成为下一代金融体系最重要的基础设施。",

            "然而，多数加密资产持有者仍然选择在中心化交易所进行交易。他们把资产转给交易平台，在相当长一段期间内放弃资产的所有权。截止2019年8月，用户在中心化交易所上共损失了超过20亿美元的加密资产。另外，黑客攻击事件通常很难区分是外部黑客的入侵盗取，还是内部人员的恶意操作。墨菲定律告诉我们“如果事情有变坏的可能，不管这种可能性有多小，它总会发生。”。因此中心化交易所的资产还会持续被盗。",

            "在这种情况下，去中心化交易所（DEX）应运而生。去中心化交易所本身就是搭建在区块链技术之上，同时采用包括智能合约在内的其它技术以确保被交易资产的安全性。我们相信不必放弃资产所有权，用户就可以在去中心化交易所上自由且低成本地交易。",

            "路印的目标是设计实现以太坊上最佳的基于订单的去中心化交易协议。我们希望为整个行业提供安全的交易基础设施，并提升加密资产持有者的交易体验。我们期待自己的努力能加速区块链技术和加密资产被更多个人和商业实体接纳，促进新一代金融体系的发展。"
        ]
    },
    "section2":
    {
        "title": "路印的安全性保障",
        "content": [
            "用户资产安全是路印协议设计中的最高优先级考量。协议之前的三个版本完全不托管用户资产。协议最新的3.0版使用智能合约托管用户交易资产。协议保障在任何情况下，用户都可将自己的资产提现，即使使用路印协议的交易所运营者从第一天起就计划作恶。",
            "路印协议3.0不基于博弈游戏理论（比如Optimistic Rollup中的博弈游戏和被动欺诈证明）。协议要求交易所运营者主动及时地提供零知识证明来验证交易所的数据准确性，以实现最高级别的安全性。",

            "如果交易所启用协议3.0的<b>链上数据可用性（OCDA）</b>功能，路印协议将为用户提供与底层以太坊区块链相同的安全级别。这意味着交易者完全不必信任去中心化交易所的管理者，运营商，甚至路印团队。也意味着基于路印协议的交易所可以一定程度上保持匿名（包括不提供任何客户服务和联系方式）。我们相信：<b>无需信任，更具信任</b>。在交易所领域，无需信任将成为是否可信的新的判断标准。"
        ]
    },
    "section3":
    {
        "title": "中心化交易所的救赎",
        "content": [
            "如果您曾经运营过中心化交易所，您就会了解那种担心被黑客攻击的压力和恐惧。路印协议确保即使所有的服务器都遭到入侵，您最坏的情况下只会损失作为交易费（gas)的一两个以太。您可以后续从这些事件中恢复您的业务。使用开源，经第三方审计过，且密码学安全的交易协议意味着您的交易所在安全保障上的投入将变得最小化，您和团队可以将资金和精力投入到更重要的商业拓展上。"
        ]
    },
    "section4":
    {
        "title": "路印突出的性能",
        "content": [
            "Most DEX protocols suffer terrible performance issues — the throughput is too low while the cost is too high. The performance issues prevent those protocols from being massively adopted as no professional market makers or traders will use these protocols as their primary methods of trading. The performance vs. security tradeoff has indeed been a polarizing one.",

            "We believe the way many trading protocols use the underlying blockchain is fundamentally flawed. Loopring takes a different approach known as <b>zkRollup</b> proposed by <b>Vitalik Buterin</b>.  zkRollup migrates most computations off the blockchain and only broadcasts exchanges' new state roots and their corresponding proofs onto the blockchain. In other words, the Loopring protocol uses the underlying Ethereum blockchain mainly as a data layer and a Zero-Knowledge Proof verification thin-logic layer. As a result, Loopring's throughput is as high as <b>350</b> trades per second with OCDA, and <b>6,900</b> trades per second without. The post-Istanbul throughput will become <b>1,400</b> and <b>10,500</b>, respectively. The cost per trade settlement is as small as 0.21 US cent, which can be further optimized, such as using GPU-based proof generation and recursive SNARKs.",
            "We believe Loopring's performance is sufficient for professional traders and market makers to deploy algorithmic strategies and other automated trading bots. By building on top of Loopring 3.0, orderbook-based DEXes can be commercially viable for the first time. We expect such DEXes to begin outcompeting and displacing many centralized counterparts."
        ]
    }
}